tobozo/esp32-DCF77_Analyzer_Clock/UI.h
#ifndef _UI_H_
#define _UI_H_

//#define LGFX_ONLY

#ifndef LGFX_ONLY

  // using ESP32-Chimera-Core device list

  //#define LGFX_ONLY
  //#undef LGFX_AUTODETECT
  //#define LGFX_LOLIN_D32_PRO
  #include <ESP32-Chimera-Core.h> // https://github.com/tobozo/ESP32-Chimera-Core or regular M5Stack Core
  #define tft M5.Lcd // syntax sugar
  //#define Display320x240 // warn: 320x240 frame buffer may exceed available ram, use tft.setColorDepth( 8 )


  void M5Begin()
  {

    if( SERIAL_SPEED != 115200 ) {
      M5.begin(true, SD_ENABLE, false);
      Serial.begin( SERIAL_SPEED );
    } else {
      M5.begin();
    }

    NVSUtils nvsUtils;

    //nvsUtils.dumpNVS("AUTODETECT");
    //nvsUtils.nvsdump( nullptr );

  }


#else

  // bypassing LovyanGFX device detection

  #include <LGFX_TFT_eSPI.hpp>
  #include <Wire.h>

  // Custom SD config
  #include <SD.h>           // or SD_MMC.h, SPIFFS.h, LittleFS.h
  #define M5STACK_SD SD     // or SD_MMC,   SPIFFS,   LittleFS
  #define USE_TFCARD_CS_PIN // comment in/out if necessary
  #define TFCARD_CS_PIN 13  // edit if necessary
  //#define DisplayPanel lgfx::Panel_ST7735S
  #define DisplayPanel lgfx::Panel_ILI9341
  //#define Display320x240

  // custom TFT config
  struct LGFX_Config
  {
    // values picked from /LovyanGFX/src/config/
    /*
    // pinout TTGO_TS
    static constexpr spi_host_device_t spi_host = VSPI_HOST;
    static constexpr int dma_channel = 1;
    static constexpr int spi_mosi = 23;
    static constexpr int spi_miso = -1;
    static constexpr int spi_sclk =  5;
    */
    // pinout LoLin D32Pro for ILI9341
    static constexpr spi_host_device_t spi_host = VSPI_HOST;
    static constexpr int dma_channel = 1;
    static constexpr int spi_sclk = 18;
    static constexpr int spi_mosi = 23;
    static constexpr int spi_miso = 19;
    static constexpr int spi_dlen = 8;
  };
  static DisplayPanel panel; // panel name picked from /LovyanGFX/src/lgfx/panel/
  //typedef lgfx::LGFX_SPI<LGFX_Config> LGFX;
  //static LGFX tft;

  static lgfx::LGFX_SPI<LGFX_Config> tft;
  //static LGFX tft;

  #include <ESP32-Chimera-Core.h> // https://github.com/tobozo/ESP32-Chimera-Core or regular M5Stack Core

  void M5Begin()
  {
    Serial.begin( SERIAL_SPEED );
    Serial.printf("Custom ESP32 started at %d bauds!", SERIAL_SPEED);

    // custom TFT pinout
    /*
    // Panel_TTGO_TS panel, pinout picked from /LovyanGFX/src/lgfx/panel/
    panel.freq_write = 20000000;
    panel.panel_width  = 128;
    panel.panel_height = 160;
    panel.offset_x     = 2;
    panel.offset_y     = 1;
    panel.offset_rotation = 2;
    panel.rgb_order = true;
    panel.spi_3wire = true;
    panel.spi_cs    = 16;
    panel.spi_dc    = 17;
    panel.gpio_rst  = 9;
    panel.gpio_bl   = 27;
    panel.pwm_ch_bl = 7;
    */


    // Panel pinout for LoLin D32Pro + ILI9341
    panel.freq_write = 20000000;
    panel.freq_fill  = 27000000;
    panel.freq_read  = 16000000;
    panel.spi_mode = 0;
    panel.spi_mode_read = 0;
    panel.len_dummy_read_pixel = 8;
    panel.spi_read = true;
    panel.spi_3wire = false;
    panel.spi_cs = 14;
    panel.spi_dc = 27;
    panel.gpio_rst = 33;
    panel.gpio_bl  = 32;
    panel.pwm_ch_bl = 7;
    panel.backlight_level = true;
    panel.invert = false;
    panel.rgb_order = false;
    panel.memory_width  = 240;
    panel.memory_height = 320;
    panel.panel_width  = 240;
    panel.panel_height = 320;
    panel.offset_x = 0;
    panel.offset_y = 0;
    panel.rotation = 0;
    panel.offset_rotation = 0;

    tft.setPanel(&panel);
    tft.init();


    tft.drawRect(10,10,20,20,0xFFFF);
    tft.print("BLAH");
    delay(1000);

    tft.clearScreen();

    #if defined ( USE_TFCARD_CS_PIN ) && defined( TFCARD_CS_PIN )

      log_d("Enabling SD from TFCARD_CS_PIN (%d)", TFCARD_CS_PIN);

      M5STACK_SD.end();
      SPI.end();
      SPI.begin();
      M5STACK_SD.begin(TFCARD_CS_PIN, SPI, 20000000);

      if ( LGFX_Config::spi_host == HSPI_HOST ) {
        tft.setSPIShared(false);
      }
    #else
      log_d("Enabling SD_MMC");
      M5STACK_SD.begin();
      tft.setSPIShared(false);
    #endif

  }

#endif



#include "Config.h"
#include "SpriteSheet.h"


#ifdef DCF77_DO_WEATHER
  #include <Preferences.h>
  //#include "NVS.h"
  #include "nvs_flash.h"
  Preferences prefs;
  static int maxEntriesPerPage = 10;
  static int entriesIndex = -1;
  static bool pickedCity = false;
  static unsigned long pickerTimeout = 5000;
  static unsigned long beforePicking = millis();
  String preferredCountry = "";
  String preferredCity    = "";

#endif

#ifdef USE_RTC
  #include "DS1307RTC.h" // a custom DS1307 library that returns time as a time_t
  DS1307RTC RTC;
#else
  #include <Time.h>
#endif

#ifdef USE_SPEAKER
  SPEAKER Speaker;
#endif

#define freeheap heap_caps_get_free_size( MALLOC_CAP_INTERNAL )

static xSemaphoreHandle mux = NULL; // this is needed to prevent rendering collisions
// between scrollpanel and heap graph
#define takeMuxSemaphore() if( mux ) { xSemaphoreTake( mux, portMAX_DELAY ); log_v( "Took Semaphore" ); }
#define giveMuxSemaphore() if( mux ) { xSemaphoreGive( mux ); log_v( "Gave Semaphore" ); }


// this is just lgfx::TextStyle with a constructor
struct TextStyle
{
  std::uint32_t fore_rgb888 = 0xFFFFFFU;
  std::uint32_t back_rgb888 = 0;
  float size_x = 1;
  float size_y = 1;
  textdatum_t datum = textdatum_t::top_left;
  bool utf8 = true;
  bool cp437 = false;
  // constructor
  TextStyle( std::uint32_t _fore_rgb888, std::uint32_t _back_rgb888, float _size_x, float _size_y, textdatum_t _datum, bool _utf8, bool _cp437 ) :
    fore_rgb888( _fore_rgb888 ), back_rgb888( _back_rgb888 ), size_x( _size_x ), size_y( _size_y ), datum( _datum ), utf8( _utf8 ), cp437( _cp437 ) { }
};

struct FontStyle
{
  const lgfx::IFont* font;
  TextStyle *style;
  // constructor
  FontStyle( const lgfx::IFont *_font, TextStyle *_style ) : font( _font ), style( _style ) { }
  // style setter
  void setTextStyle( TextStyle *_style ) {
    style = _style;
  }
};


