tobozo/esp32-DCF77_Analyzer_Clock/UI.h
struct BoxStyle
{
  const std::uint32_t fillColor;
  FontStyle* style;
  BoxStyle( const std::uint32_t  f, FontStyle *s ) : fillColor(f), style(s) { }
};


// helper for setFontStyle
void setTextStyle( M5Display *_tft, TextStyle *style )
{
  lgfx::TextStyle myStyle; // why no constructor ??
  myStyle.fore_rgb888 = style->fore_rgb888;
  myStyle.back_rgb888 = style->back_rgb888;
  myStyle.size_x      = style->size_x;
  myStyle.size_y      = style->size_y;
  myStyle.datum       = style->datum;
  myStyle.utf8        = style->utf8;
  myStyle.cp437       = style->cp437;
  _tft->setTextStyle( myStyle );
}

void setFontStyle( M5Display *_tft, FontStyle *myFontStyle )
{
  _tft->setFont( myFontStyle->font );
  setTextStyle( _tft, myFontStyle->style );
}


// helper for setFontStyle
void setTextStyle( TFT_eSprite *sprite, TextStyle *style )
{
  lgfx::TextStyle myStyle; // why no constructor ??
  myStyle.fore_rgb888 = style->fore_rgb888;
  myStyle.back_rgb888 = style->back_rgb888;
  myStyle.size_x      = style->size_x;
  myStyle.size_y      = style->size_y;
  myStyle.datum       = style->datum;
  myStyle.utf8        = style->utf8;
  myStyle.cp437       = style->cp437;
  sprite->setTextStyle( myStyle );
}

void setFontStyle( TFT_eSprite *sprite, FontStyle *myFontStyle )
{
  sprite->setFont( myFontStyle->font );
  setTextStyle( sprite, myFontStyle->style );
}


#if defined UI_320x240
  #include "UI_320x240.h"
#elif defined UI_160x128
  #include "UI_160x128.h"
#else
  #error "Please define either UI_320x240 or UI_160x128"
#endif


#include "DCF77.h"


static TFT_eSprite sprite = TFT_eSprite( &tft );

#ifdef DCF77_DO_WEATHER
  static TFT_eSprite ScrollSprite = TFT_eSprite( &tft );
#endif
static TFT_eSprite MainSprite = TFT_eSprite( &tft );
static TFT_eSprite MaskSprite = TFT_eSprite( &tft );
static TFT_eSprite LogoSprite = TFT_eSprite( &tft );

static uint16_t TFT_HALFWIDTH;//    tft.width()/2
static uint16_t TFT_HALFHEIGHT;//   tft.height()/2
static uint16_t RingLabelsFontHeight = 0;
static uint16_t RingLabelsFontWidth  = 0;
static uint16_t ErrorsCountFontHeight = 0;
static uint16_t ErrorsCountFontWidth  = 0;
static uint16_t tmpFontHeight = 0;
static uint16_t tmpFontWidth  = 0;
static uint16_t LedWeekStatusFontWidth = 0;
static uint16_t LedWeekStatusFontHeight = 0;
static uint16_t LedErrorStatusFontWidth = 0;
static uint16_t LedErrorStatusFontHeight = 0;
static uint16_t LedParityStatusFontWidth = 0;
static uint16_t LedParityStatusFontHeight = 0;
static uint16_t LedDCFStatusFontWidth = 0;
static uint16_t LedDCFStatusFontHeight = 0;
static uint16_t LedDisplayFontHeight = 0;
//static uint16_t BufferFontHeight = 0;
static uint16_t RTCDateFontHeight = 0;

//static uint16_t timeColor;

static uint16_t weekDayNamesWidth = 0;
static uint16_t CETWidth = 0;
static uint16_t CETXPos = 0;
static uint16_t CESTWidth = 0;
static uint16_t CESTXpos = 0;
static uint16_t LEAPWidth = 0;
static uint16_t LEAPXPos = 0;

int16_t  x, y;
uint16_t w, h;

float MinuteSteps = ( TWO_PI / 60 ) / 5;

float r1 = float_r1; // inner ring
float r2 = float_r2; // outer ring
float r3 = float_r3; // inner 10's mark
float r4 = float_r4; // inner 10's label

enum UIModes
{
  DCF_CLOCK, // default
  #ifdef DCF77_DO_WEATHER
  DCF_SETUP,
  #endif
  COOK_TIMER // bonus ^^
};

UIModes UIMode = DCF_CLOCK;
//UIModes UIMode = COOK_TIMER;


#ifdef DCF77_DO_WEATHER
  static String scrollText = "blah bleh blih bloh bluh blyh blah bleh blih bloh bluh blyh ";
  static uint16_t scrollWidth;
  static uint16_t scrollHeight;
  static int scrollPos = 0;
  //static int scrollFontSize = int_scrollFontSize;
  //static bool isScrolling = false;
  //static uint16_t scrollFontColor;
  //static uint16_t scrollFontColorDisabled = TFT_DARKGRAY;
  //static uint16_t scrollFontColorEnabled = TFT_GRAY;
#endif

//void sprite_drawJpg( TFT_eSprite *spr, int16_t x, int16_t y, const uint8_t * jpg_data, size_t jpg_len, uint16_t maxWidth, uint16_t maxHeight );


void tft_drawSpriteSheet( SpriteSheetIcon icon, uint16_t x=0, uint16_t y=0 )
{
  uint16_t offsetx = (icon%16)*32;
  uint16_t offsety = (icon/16)*32;
  tft.drawJpg( sprite_jpg, sprite_jpg_len, x, y, 32, 32, offsetx, offsety );
}

void sprite_drawSpriteSheet( TFT_eSprite &sprite, SpriteSheetIcon icon, uint16_t x=0, uint16_t y=0 )
{
  uint16_t offsetx = (icon%16)*32;
  uint16_t offsety = (icon/16)*32;
  //log_e("sprite.drawSpriteSheet( %d, %d, %d, %d, %d, %d );", x, y, 32, 32, offsetx, offsety );
  sprite.fillRect( x, y, 32, 32, TFT_BLACK );
  sprite.drawJpg( sprite_jpg, sprite_jpg_len, x, y, 32, 32, offsetx, offsety );
  //log_e("done");
}

static void getTextBounds( TFT_eSprite *sprite, const char *string, uint16_t *w, uint16_t *h )
{
  *w = sprite->textWidth( string );
  *h = sprite->fontHeight();
}


#include "CookTimer.h"
#include "Tasks.h"


#if defined USE_BUTTONS

  #if defined( BUTTON_A_PIN ) &&  defined( BUTTON_B_PIN ) &&  defined( BUTTON_C_PIN )

  void checkButtons()
  {
    //static byte longPushCounter = 0;
    M5.update();
    if ( longPushCounter >= 30 /*|| M5.BtnC.pressedFor( 1000 )*/ ) {
      longPushCounter = 0;
      // long press = switch UI mode
      switch( UIMode ) {
        #ifdef DCF77_DO_WEATHER
          case DCF_SETUP:
            // TODO: find something to do with long press when in setup mode :-)
          break;
        #endif
        case DCF_CLOCK:
          UIMode = COOK_TIMER;
          cookTimerSetup();
        break;
        case COOK_TIMER:
          UIMode = DCF_CLOCK;
          cookTimerStop();
        break;
      }
      // wait for button release
      while( M5.BtnC.isPressed() ) M5.update();
    }
    switch( UIMode ) {
      #ifdef DCF77_DO_WEATHER
        case DCF_SETUP:
          if ( M5.BtnA.wasPressed() ) { entriesIndex--; pickerTimeout = 600000; beforePicking = millis(); log_w("entriesIndex : %d", entriesIndex ); }
          if ( M5.BtnB.wasPressed() ) { entriesIndex++; pickerTimeout = 600000; beforePicking = millis(); log_w("entriesIndex : %d", entriesIndex ); }
          if ( M5.BtnC.wasPressed() ) pickedCity = true;
        break;
      #endif
      case DCF_CLOCK:
        if( M5.BtnC.isPressed() ) longPushCounter++;
        else longPushCounter = 0;
        #ifdef DCF77_DO_WEATHER
          if ( M5.BtnA.wasPressed() ) dumpWeather();
        #endif
        if ( M5.BtnB.wasPressed() ) dcf77SoundSwitch = 1 - dcf77SoundSwitch;
      break;
      case COOK_TIMER:
        if( M5.BtnC.isPressed() ) { longPushCounter++; CookTimerButtonPos = BUTTON_CLICK; }
        else if( M5.BtnB.isPressed() ) { longPushCounter = 0; CookTimerButtonPos = BUTTON_RIGHT; }
        else if( M5.BtnA.isPressed() ) { longPushCounter = 0; CookTimerButtonPos = BUTTON_LEFT; }
        else { longPushCounter = 0; CookTimerButtonPos = BUTTON_NEUTRAL; }
      break;
    }
    //delay(50);
  }

  #else
    // TODO: implement touch or other input methods
  #endif


#else

  void checkSerial()
  {
    if( Serial.available() ) {
      String respStr = Serial.readStringUntil('\n');
      int resp = respStr.toInt();
      if( resp < 0 || resp > citiesLength ) {
        Serial.println("Invalid entry, please provide the City ID, not the name");
        pickerTimeout = 600000;
        beforePicking = millis();
      } else {
        Serial.printf("Selecting city #%d ( %s / %s", resp, cities[resp].country.name, cities[resp].name );
        entriesIndex = resp;
        pickedCity = true;
      }
    }
  }

#endif


#ifdef DCF77_DO_WEATHER

  static void updateIcons( SpriteSheetIcon icon1, SpriteSheetIcon icon2, SpriteSheetIcon icon3 )
  {
    needrendering = 0;
    uint16_t posx = ( TFT_HALFWIDTH - 32 / 2 );
    uint16_t posy = ( TFT_HALFHEIGHT - 32 / 2 );

    if( icon1 != nullicon && icon1 != lasticon1 ) {
      lasticon1 = icon1;
      needrendering++;
      log_w("Icon1 will be rendererd with #%d", icon1 );
      drawIconTask( icon1, posx-32, posy );
      vTaskDelay(200);
    }
    if( icon2 != nullicon && icon2 != lasticon2 ) {
      lasticon2 = icon2;
      needrendering++;
      log_w("Icon2 will be rendererd with #%d", icon2 );
      drawIconTask( icon2, posx, posy );
      vTaskDelay(200);
    }
    if( icon3 != nullicon && icon3 != lasticon3 ) {
      lasticon3 = icon3;
      needrendering++;
      log_w("Icon3 will be rendererd with #%d", icon3 );
      drawIconTask( icon3, posx+32, posy );
      vTaskDelay(200);
    }
    if( needrendering > 0 ) {
      while( needrendering > 1 ) {
        takeMuxSemaphore();
        sprite.pushSprite( 0, 0 );
        giveMuxSemaphore();
        vTaskDelay( 10 );
      }
    }
  }


  void setupScroll()
  {

    takeMuxSemaphore();
    ScrollSprite.createSprite( tft.width(), scrollHeight );
    //ScrollSprite.fillSprite( TFT_BLACKISH );
    //ScrollSprite.setTextColor( scrollFontColor, TFT_BLACKISH );
    scrollFontStyle->setTextStyle( scrollStyleDisabled );
    setFontStyle( &ScrollSprite, scrollFontStyle );
    giveMuxSemaphore();

    takeMuxSemaphore();
    MaskSprite.createSprite( tft.width(), scrollHeight );
    MaskSprite.fillSprite( TFT_BLACK );
    MaskSprite.setSwapBytes( true );
    giveMuxSemaphore();
  }

  void unsetupScroll()
  {
    MaskSprite.deleteSprite();
    ScrollSprite.deleteSprite();
  }


  void initScroll( String text/*="                             Meteo is loading" */ )
  {
    scrollText = text;
    scrollPos = 0;
    //scrollFontSize = int_scrollFontSizeSmall;
    //scrollFontColor = scrollFontColorDisabled;
    scrollFontStyle->setTextStyle( scrollStyleDisabled );
    /*
    takeMuxSemaphore();
    uint16_t* mainSpritePtr = (uint16_t*)MainSprite.createSprite( tft.width(), tft.height() );
    if( mainSpritePtr == NULL ) {
      log_e("Unable to create mainSpritePtr");
    } else {
      log_n("Successfully created mainSpritePtr");
    }
    MainSprite.fillSprite( TFT_BLACK );
    MainSprite.setSwapBytes( true );
    giveMuxSemaphore();*/

    setFontStyle( &ScrollSprite, scrollFontStyle );
    //tft_setFont( scrollFontSize, ScrollSprite );
    getTextBounds( &sprite, scrollText.c_str(), &scrollWidth, &scrollHeight );

