tobozo/esp32-DCF77_Analyzer_Clock/UI.h
  sprite.setTextColor(TFT_BLACK, TFT_BLACK);//Brett
  sprite.setCursor (0, 180);//Brett  across then down
  sprite.print("        "); // This uses the standard ADAFruit small font  //Brett

  sprite.setTextColor(TFT_GREEN, TFT_BLACK);//Brett
  sprite.setCursor (0, 180);//Brett  across then down
  sprite.print(hour()); // This uses the standard ADAFruit small font  //Brett
  sprite.setCursor (12, 180);//Brett  across then down
  sprite.print(":"); // This uses the standard ADAFruit small font  //Brett
  sprite.setCursor (18, 180);//Brett  across then down
  sprite.print(minute()); // This uses the standard ADAFruit small font  //Brett
  sprite.setCursor (30, 180);//Brett  across then down
  sprite.print(":"); // This uses the standard ADAFruit small font  //Brett
  sprite.setCursor (36, 180);//Brett  across then down
  sprite.print(bufferPosition +1); // This uses the standard ADAFruit small font  //Brett

  sprite.setTextColor(TFT_BLACK, TFT_BLACK);//Brett
  sprite.setCursor (0, 190);//Brett  across then down
  sprite.print("          "); // This uses the standard ADAFruit small font  //Brett

  sprite.setTextColor(TFT_GREEN, TFT_BLACK);//Brett
  sprite.setCursor (0, 190);//Brett  across then down
  sprite.print(day()); // This uses the standard ADAFruit small font  //Brett


  sprite.setTextColor(TFT_GREEN, TFT_BLACK);//Brett
  sprite.setCursor (12, 190);//Brett  across then down
  sprite.print(":"); // This uses the standard ADAFruit small font  //Brett

  sprite.setTextColor(TFT_GREEN, TFT_BLACK);//Brett
  sprite.setCursor (18, 190);//Brett  across then down
  sprite.print(month()); // This uses the standard ADAFruit small font  //Brett

  sprite.setTextColor(TFT_GREEN, TFT_BLACK);//Brett
  sprite.setCursor (30, 190);//Brett  across then down
  sprite.print(":"); // This uses the standard ADAFruit small font  //Brett

  sprite.setTextColor(TFT_GREEN, TFT_BLACK);//Brett
  sprite.setCursor (36, 190);//Brett  across then down
  sprite.print(year()); // This uses the standard ADAFruit small font  //Brett
  giveMuxSemaphore();
}



static const char weekStr[] = "SMTWTFS";

void drawWeekDays( int daynum )
{

  int hpos = sprite.width();
  int vpos = sprite.height();
  int margin = 1;

  int boxWidth = LedWeekStatusFontWidth + (margin);
  int boxHeight = (LedWeekStatusFontHeight + (margin*2))-1;

  int boxCenterX = boxWidth/2 - margin;
  int boxCenterY = boxHeight/2 + margin*2;

  hpos -= (boxWidth*7); // right aligned
  vpos -= (boxHeight);

  setFontStyle( &sprite, LedWeekStatusFontStyle );

  for ( byte pos = 0; pos < 7; pos++ ) {
    if ( daynum > -1 && daynum == pos ) {
      sprite.fillCircle( hpos+(boxWidth/2), vpos-2, 1, TFT_ORANGE );
      sprite.fillRect( hpos, vpos, boxWidth, boxHeight, TFT_DARKRED );
      sprite.setTextColor( TFT_UGRAY );
    } else {
      sprite.fillCircle( hpos+(boxWidth/2), vpos-2, 1, TFT_DARKGRAY );
      sprite.drawCircle( hpos+(boxWidth/2), vpos-2, 1, TFT_GRAY );
      if( pos == 0 || pos == 6 ) {
        sprite.fillRect( hpos, vpos, boxWidth, boxHeight, TFT_ORANGE );
      } else {
        sprite.fillRect( hpos, vpos, boxWidth, boxHeight, TFT_LIGHTGRAY );
      }
      sprite.setTextColor( TFT_GRAY );
    }
    sprite.drawChar( weekStr[pos],  hpos+boxCenterX+LedWeekStatusMarginX, vpos+boxCenterY+LedWeekStatusMarginY );//Brett move weekday text left right -x   down and up -y
    hpos += boxWidth;
  }

}


#ifdef DCF77_DO_WEATHER

static const char weatherBitsStatusStr[] = "123";

static const String weatherBitsStr[3] = { "110", "101", "011" };

void LedWeatherStatus( int bitnumber, int bitstatus, bool echo = true )
{

  int bitposition = 0;

  setFontStyle( &sprite, LedWeekStatusFontStyle );

  switch( bitnumber ) {
    case 0: bitposition = 2; if( echo ) Serial.println( "Received Meteo Bits 29-42" ); break;
    case 1: bitposition = 0; if( echo ) Serial.println( "Received Meteo Bits 01-14" );  break;
    case 2: bitposition = 1; if( echo ) Serial.println( "Received Meteo Bits 15-28" ); break;
    default: log_e("Invalid meteo bit index !!"); return;
  }

  switch( bitstatus ) {
    case -1: sprite.setTextColor( TFT_RED ); if( echo ) log_w("weather data couldn't be decrypted/uncompressed"); break;
    case  0: sprite.setTextColor( TFT_GRAY );/* grey */ break;
    case  1: sprite.setTextColor( TFT_GREEN );/* green */ break;
    default: log_e("Invalid meteo bit status !!");
  }

  int hpos = 0; // left aligned
  int vpos = sprite.height(); // bottom aligned
  int margin = 1;

  for( int i=0;i<3;i++) {
    getTextBounds( &sprite, weatherBitsStr[i].c_str(), &tmpFontWidth, &tmpFontHeight );
    int boxCenterX = /*(tmpFontWidth/2)+*/margin;
    int boxCenterY = (tmpFontHeight/2)-margin;
    if( bitposition == 0 ) {
      // resetting, process all
      sprite.drawString( weatherBitsStr[i], hpos+boxCenterX, (vpos-tmpFontHeight)+boxCenterY );
      if( i==0 ) sprite.setTextColor( TFT_GRAY );
    } else {
      // updating, process one
      if( bitposition == i ) sprite.drawString( weatherBitsStr[i], hpos+boxCenterX, (vpos-tmpFontHeight)+boxCenterY );
    }
    hpos += tmpFontWidth;
  }

}

#endif



void LedWeekStatus( int weekDay, int status )
{
  int xpos = tft.width() - ( weekDayNamesWidth + 1 );
  //int ypos = ( tft.height() - (LedWeekStatusFontHeight) ) - 3;
  int weekDayBlockWidth = LedWeekStatusFontWidth + 2;
  int wpos = -1;

  switch ( weekDay ) {
    case 22: // LED_SUNDAY    // output - LED - Sunday
      wpos = 0;
      xpos += 0;
    break;
    case 23: // LED_MONDAY    // output - LED - Monday
      wpos = 1;
      xpos += weekDayBlockWidth;
    break;
    case 24: // LED_TUESDAY   // output - LED - Tuesday
      wpos = 2;
      xpos += weekDayBlockWidth * 2;
    break;
    case 25: // LED_WEDNESDAY // output - LED - Wednesday
      wpos = 3;
      xpos += weekDayBlockWidth * 3;
    break;
    case 26: // LED_THURSDAY  // output - LED - Thursday
      wpos = 4;
      xpos += weekDayBlockWidth * 4;
    break;
    case 27: // LED_FRIDAY    // output - LED - Friday
      wpos = 5;
      xpos += weekDayBlockWidth * 5;
    break;
    case 28: // LED_SATURDAY  // output - LED - Saturday
      wpos = 6;
      xpos += weekDayBlockWidth * 6;
    break;
    case 29: // LED_CEST      // output - LED - Summertime CEST
      takeMuxSemaphore();
      setFontStyle( &sprite, status ?  BoxSelected->style : BoxUnSelected->style );
      sprite.fillRect( CESTXpos, CETCESTYPos - LedWeekStatusFontHeight - 1, CESTWidth + 2, LedWeekStatusFontHeight+1, status ? BoxSelected->fillColor : BoxUnSelected->fillColor );
      sprite.drawString( "CEST", CESTXpos + 1, (CETCESTYPos - LedWeekStatusFontHeight) );
      giveMuxSemaphore();
      return;
    break;
    case 30: // LED_CET       // output - LED - Wintertime CET
      takeMuxSemaphore();
      setFontStyle( &sprite, status ?  BoxSelected->style : BoxUnSelected->style );
      sprite.fillRect( CETXPos, CETCESTYPos - LedWeekStatusFontHeight - 1, CETWidth + 2, LedWeekStatusFontHeight+1, status ? BoxSelected->fillColor : BoxUnSelected->fillColor );
      sprite.drawString( "CET", CETXPos + 1, (CETCESTYPos - LedWeekStatusFontHeight) );
      giveMuxSemaphore();
      return;
    break;
    case 31: // LED_LEAPYEAR  // output - LED - Leap year
      takeMuxSemaphore();
      setFontStyle( &sprite, status ?  BoxSelected->style : BoxUnSelected->style );
      sprite.fillRect( LEAPXPos, LeapYearYpos - LedWeekStatusFontHeight - 1, LEAPWidth + 2, LedWeekStatusFontHeight+1, status ? BoxSelected->fillColor : BoxUnSelected->fillColor );
      sprite.drawString( "LEAP", LEAPXPos + 1, (LeapYearYpos - LedWeekStatusFontHeight) );
      giveMuxSemaphore();
      return;
    break;
    case 51: // LED_WEEKNUMBER
      char weekNumStr[5];
      sprintf( weekNumStr, "W:%02d", weekNumber );
      takeMuxSemaphore();
      setFontStyle( &sprite, weekNumber > 0 ?  BoxSelected->style : BoxUnSelected->style );
      tmpFontWidth = sprite.textWidth( weekNumStr );
      sprite.fillRect( tft.width() - (tmpFontWidth + 2), WeekNumberYpos - 1, tmpFontWidth + 2, LedWeekStatusFontHeight+1, weekNumber > 0 ? BoxSelected->fillColor : BoxUnSelected->fillColor );
      sprite.drawString( String( weekNumStr ), tft.width() - (tmpFontWidth + 1), WeekNumberYpos );
      giveMuxSemaphore();
      return;
    break;
    default:
      log_d("Invalid weekDay: %d", weekDay);
      return;
  }

  takeMuxSemaphore();
  if( wpos > -1 ) {
    drawWeekDays( wpos );
  }
  giveMuxSemaphore();
}


