tobozo/esp32-DCF77_Analyzer_Clock/UI.h
  }
#endif


void scheduleBuzz( uint16_t note, int duration )
{
  #ifdef USE_SPEAKER
    willBuzzNote = note;
    willBuzzDuration = duration;
  #endif
}


#ifdef DCF77_DO_WEATHER

  char countryCityHolder[64];
  //int citiesLength = 0;
  int halfPage = 0;

  void paginateCities()
  {

    if( entriesIndex < 0 ) {
      entriesIndex = citiesLength-1;
    }
    if( entriesIndex >= citiesLength ) {
      entriesIndex = 0;
    }

    int pageStart = entriesIndex - halfPage;
    int pageEnd   = entriesIndex + halfPage ;

    if( entriesIndex < halfPage ) {
      pageEnd+=halfPage;
    }

    if( pageEnd >= citiesLength ) {
      pageEnd = citiesLength-1;
    }
    if( pageStart < 0 ) {
      pageStart = 0;
    }

    log_d("Found %d cities, paginating from %d to %d (index=%d)", citiesLength, pageStart, pageEnd, entriesIndex );

    sprite.fillScreen( CountryCityFontStylePicoDisabled->style->back_rgb888 );

    uint8_t linenum = 0;

    for( int i=pageStart; i<=pageEnd; i++ ) {
      if( cities[i].name == nullptr ) continue;
      if( i == entriesIndex ) {
        setFontStyle( &sprite, CountryCityFontStylePicoEnabled );
      } else {
        setFontStyle( &sprite, CountryCityFontStylePicoDisabled );
      }
      sprintf( countryCityHolder, " %s : %s ", cities[i].country.name, cities[i].name );
      sprite.drawString( countryCityHolder, 0, linenum*RTCDateFontHeight );
      linenum++;
    }
    sprite.pushSprite( 0, 0/*, TFT_BLACK*/ );
  }


  void LoadCountryPref( const countryBycode* country )
  {
    watchedCountry = (countryBycode*)country;
  }
  void LoadCityPref( const char* city )
  {
    watchedCity = (char*)city;
  }


  void CountryCityWizard( unsigned long timeout )
  {
    #ifndef USE_BUTTONS
      // TODO: handle serial input instead of blaming the lack of HID
      log_n("Please find your preferred city and enter the number");
      //return;
    #endif
    maxEntriesPerPage = tft.height() / RTCDateFontHeight;
    halfPage = maxEntriesPerPage / 2;
    log_d("maxEntriesPerPage / citiesLength / halfPage : %d / %d / %d", maxEntriesPerPage, citiesLength, halfPage);
    for( int i=0; i<citiesLength; i++ ) {
      #ifndef USE_BUTTONS
        log_n("[%2d] %s / %s",  i, cities[i].country.name, cities[i].name );
      #else
        log_d("Index / Country / City: %d / %s / %s",  i, cities[i].country.name, cities[i].name );
      #endif
    }
    UIMode = DCF_SETUP;
    beforePicking = millis();
    //bool has_timed_out = false;
    pickerTimeout = timeout;
    while( !pickedCity ) {
      #ifndef USE_BUTTONS
        checkSerial();
      #else
        checkButtons();
        paginateCities();
      #endif
      if( beforePicking + pickerTimeout < millis() ) {
        //has_timed_out = true;
        break;
      }
    }
    if(  preferredCountry != String( cities[entriesIndex].country.name )
      || preferredCity    != String( cities[entriesIndex].name ) ) {
      // save only if choice changed
      log_w("Prefs have changed, clearing/saving!");

      /*
      prefs.begin("DCF77WData", false);
      prefs.clear();
      prefs.end();
      */
      //esp_err_t result = nvs_flash_erase();

      prefs.begin("DCF77Prefs", false);
      prefs.clear();
      prefs.putString( "country", cities[entriesIndex].country.name );
      prefs.putString( "city", cities[entriesIndex].name );
      prefs.end();
    }
    LoadCountryPref( &cities[entriesIndex].country );
    LoadCityPref( cities[entriesIndex].name );
    sprite.fillScreen( TFT_BLACK );
    sprite.pushSprite( 0, 0 );
    UIMode = DCF_CLOCK;
  }


  void InitPrefs()
  {

    #if defined FORCED_WATCHED_CITY && defined FORCED_WATCHED_COUNTRY
      preferredCountry = String( FORCED_WATCHED_COUNTRY );
      preferredCity    = String( FORCED_WATCHED_CITY );
    #else
      prefs.begin("DCF77Prefs", true);
      preferredCountry = prefs.getString("country");
      preferredCity    = prefs.getString("city");
      prefs.end();
    #endif
    //citiesLength = ( sizeof(cities) / sizeof(cityByCountry) ) -1;


    if( preferredCountry != "" ) {
      log_w("Found preferredCountry '%s' in NVS, will compare with local list", preferredCountry.c_str() );
      const countryBycode* country = findCountryByName( preferredCountry.c_str() );
      const char* prefcity = preferredCity.c_str();
      if( country != nullptr ) {
        LoadCountryPref( country );
        if( preferredCity != "" ) {
          log_w("Found preferredCity '%s' in NVS, will compare with local list", prefcity );
          int cityID = findCityIDByName( prefcity );
          if( cityID > -1 ) {
            LoadCityPref( prefcity );
            for( int i=0; i<citiesLength; i++ ) {
              if( strcmp( prefcity, cities[i].name )==0 && strcmp( country->name, cities[i].country.name )==0 ) {
                entriesIndex = i;
                #if defined FORCED_WATCHED_CITY && defined FORCED_WATCHED_COUNTRY
                  CountryCityWizard( 100 );
                #else
                  CountryCityWizard( 5000 );
                #endif

                log_w("Free heap before weather data memory allocation: %d", ESP.getFreeHeap() );
                initWeatherForecastCache();
                initMyCityForecastsCache();
                log_w("Free heap after weather data memory allocation: %d", ESP.getFreeHeap() );
                return;
              }
            }
          } // else invalid city or end of array
        } // else empty city name returned from prefs
      } // else invalid country or end of array
    } // else empty country name returned from prefs
    CountryCityWizard( 600000 );

    log_w("Free heap before weather data memory allocation: %d", ESP.getFreeHeap() );
    initWeatherForecastCache();
    initMyCityForecastsCache();
    log_w("Free heap after weather data memory allocation: %d", ESP.getFreeHeap() );

  }
#endif


void InitPins()
{
  // initialize PIN connections
  pinMode( DCF77PIN,           INPUT );
  #ifdef DCF77_pdnPort
    pinMode( DCF77_pdnPort, OUTPUT );
    digitalWrite( DCF77_pdnPort, LOW );  // LOW=turn on radio
  #endif
  #ifdef DCF77_gainPort
    pinMode( DCF77_gainPort, OUTPUT );
    digitalWrite( DCF77_gainPort, HIGH );  // HIGH=turn on autogain
  #endif
}


void initSpeaker()
{
  #ifdef USE_SPEAKER
    // TONE
    Speaker.begin();
    Speaker.setVolume( 2 );
    marioIntro();
  #endif
}


void initRTC()
{
  #ifdef USE_RTC
    Wire.begin( DS1307_SDA, DS1307_SCL );
    #ifdef _CHIMERA_CORE_
      M5.I2C.scan();
    #endif
    // Initialize RTC and set as SyncProvider.
    // Later RTC will be synced with DCF time
    RTC.begin( DS1307_SDA, DS1307_SCL );
    //delay(10);
    setSyncProvider( RTC.get );   // the function to get the time from the RTC
    //delay(500);
    // check if RTC has set the system time
    if ( timeStatus() != timeSet ) { // Unable to sync with the RTC - activate RTCError LED
      LedErrorStatus(LED_RTCERROR, HIGH);
      log_e( "RTC Time is not set! RTC.isrunning: %x", RTC.isrunning() );
      // use for test purposes and/or setting the RTC time manually
      //setTime(11, 15, 40, 13, 8, 19);
      //RTC.set(now());
    } else {
      // RTC has set the system time - dim RTCError LED
      LedErrorStatus( LED_RTCERROR, LOW );
      log_d( "hh:mm:ss: %02d:%02d:%02d", hour(), minute(), second() );
    }
  #endif
}


static void InitUI()
{
  tft.clear();
  tft.setRotation( displayRotation );

