tobozo/esp32-DCF77_Analyzer_Clock/UI.h
  tft.fillScreen( TFT_BLACKISH );

  //morphSprite();

  tft.fillScreen( TFT_BLACKISH );

  if( tft.width()>=320 ) {
    if( psramInit() ) {
      //sprite.setPsram( true );
    }
  }

  uint16_t* spritePtr = (uint16_t*)sprite.createSprite( tft.width(), tft.height() );
  if( spritePtr == NULL ) {
    log_e("Unable to create 16bits spritePtr, will go with 8bits");
    sprite.setColorDepth( 8 );
    spritePtr = (uint16_t*)sprite.createSprite( tft.width(), tft.height() );
  } else {
    log_d("Successfully created spritePtr");
  }
  sprite.fillSprite( TFT_BLACK );
  uint16_t* logoSpritePtr = (uint16_t*)LogoSprite.createSprite( 32, 32 );
  if( logoSpritePtr == NULL ) {
    log_e("Unable to create logoSpritePtr");
  } else {
    log_d("Successfully created logoSpritePtr");
  }

  TFT_HALFWIDTH = tft.width() / 2;
  TFT_HALFHEIGHT = tft.height() / 2;

  uint16_t centericonposx = ( TFT_HALFWIDTH - 32 / 2 );
  uint16_t centericonposy = ( TFT_HALFHEIGHT - 32 / 2 );

  setFontStyle( &sprite, LedWeekStatusFontStyle );
  getTextBounds( &sprite, "W", &LedWeekStatusFontWidth, &LedWeekStatusFontHeight );

  setFontStyle( &sprite, LedErrorStatusFontStyle );
  getTextBounds( &sprite, "W", &LedErrorStatusFontWidth, &LedErrorStatusFontHeight );

  setFontStyle( &sprite, LedParityStatusFontStyle );
  getTextBounds( &sprite, "W", &LedParityStatusFontWidth, &LedParityStatusFontHeight );

  setFontStyle( &sprite, LedDCFStatusFontStyle );
  getTextBounds( &sprite, "W", &LedDCFStatusFontWidth, &LedDCFStatusFontHeight );

  setFontStyle( &sprite, ErrorsCountFontStyle );
  getTextBounds( &sprite, "W", &ErrorsCountFontWidth, &ErrorsCountFontHeight );

  setFontStyle( &sprite, RingLabelsFontStyle );
  getTextBounds( &sprite, "W", &RingLabelsFontWidth, &RingLabelsFontHeight );

  setFontStyle( &sprite, LedDisplayFontStyle );
  getTextBounds( &sprite, "W", &w, &LedDisplayFontHeight );

  setFontStyle( &sprite,  myRTCDateFontStyle );
  getTextBounds( &sprite, "W", &w, &RTCDateFontHeight );

  setFontStyle( &sprite, BoxSelected->style );
  getTextBounds( &sprite, "LEAP", &LEAPWidth, &h );
  getTextBounds( &sprite, "CET", &CETWidth, &h );
  getTextBounds( &sprite, "CEST", &CESTWidth, &h );
  CESTXpos = tft.width() - ( CESTWidth + 2 );
  CETXPos  = tft.width() - ( CETWidth + 2 + 2 + CESTWidth + 2 );
  LEAPXPos = tft.width() - ( LEAPWidth + 2 );

  #ifdef DCF77_DO_WEATHER
    InitPrefs();
  #endif

  LogoSprite.fillSprite( TFT_BLACKISH );

  setFontStyle( &sprite, LedParityStatusFontStyle );
  getTextBounds( &sprite, "011001010 P", &tmpFontWidth, &tmpFontHeight );
  sprite.fillRect( 0,                                       tft.height() - (LedParityStatusFontHeight + 2), tmpFontWidth - LedParityStatusFontWidth, LedParityStatusFontHeight+1, TFT_LIGHTGRAY );
  sprite.fillRect( tmpFontWidth - LedParityStatusFontWidth, tft.height() - (LedParityStatusFontHeight + 2), LedParityStatusFontWidth + 2,            LedParityStatusFontHeight+1, TFT_ORANGE);
  sprite.setTextColor( TFT_DARKGRAY );
  sprite.drawString( "011001010 P", 1, tft.height() - (LedParityStatusFontHeight + 1)  );
  #ifdef DCF77_DO_WEATHER
    // clear area from dummy text
    sprite.fillRect( 0,                                       tft.height() - (LedParityStatusFontHeight + 2), tmpFontWidth - LedParityStatusFontWidth, LedParityStatusFontHeight+1, TFT_LIGHTGRAY );
  #endif

/*
  sprite.setCursor( 1, tft.height() - (LedParityStatusFontHeight + 1 ) );
  sprite.setTextColor( TFT_DARKGRAY, TFT_LIGHTGRAY );
  sprite.print("01100101 ");
  sprite.setTextColor( TFT_DARKGRAY, TFT_ORANGE );
  sprite.print("P");
*/

  LedParityStatus( 1, -1 ); // H
  LedParityStatus( 2, -1 ); // M
  LedParityStatus( 3, -1 ); // S
  LedDCFStatus( -1 );

  LedWeekStatus( LED_CEST, LOW );
  LedWeekStatus( LED_CET, LOW );
  LedWeekStatus( LED_LEAPYEAR, LOW );

  drawIcon( atomic, centericonposx, centericonposy );

  setRingCoords(); // cache ring coords
  drawRing();
  //drawWeekDays( -1 );

  sprite.pushSprite( 0, 0, TFT_BLACK );
}


void displayData( void )
{
  if( dcfWeekDay + weekNumber + dcfDay + dcfMonth + dcfYear + dcfDST + leapYear == 0 ) {
    // uh-oh
    log_e("Cowardly refusing to render with an empty data load (also zero is evil)");
    return;
  }
  // display Day of Week
  switch ( dcfWeekDay ) {
    case 1: LedWeekStatus( LED_MONDAY, HIGH ); break;
    case 2: LedWeekStatus( LED_TUESDAY, HIGH ); break;
    case 3: LedWeekStatus( LED_WEDNESDAY, HIGH ); break;
    case 4: LedWeekStatus( LED_THURSDAY, HIGH ); break;
    case 5: LedWeekStatus( LED_FRIDAY, HIGH ); break;
    case 6: LedWeekStatus( LED_SATURDAY, HIGH ); break;
    case 7: LedWeekStatus( LED_SUNDAY, HIGH ); break;
  }
  // display Summer- or Wintertime LED
  if ( dcfDST == 1 ) {
    LedWeekStatus( LED_CET, LOW );
    LedWeekStatus( LED_CEST, HIGH );
  } else {
    LedWeekStatus( LED_CEST, LOW );
    LedWeekStatus( LED_CET, HIGH );
  }
  // display Leap Year LED
  if ( leapYear == 1 ) {
    LedWeekStatus( LED_LEAPYEAR, HIGH );
  } else {
    LedWeekStatus( LED_LEAPYEAR, LOW );
  }
  LedWeekStatus( LED_WEEKNUMBER, weekNumber );
  Serial.printf( "DCF77 Timestamp : [20%02d-%02d-%02d %02d:%02d:%02d], DST: %d, leap: %d, weekDay: %d, weekNum: %d\n",
    dcfYear,
    dcfMonth,
    dcfDay,
    dcfHour,
    dcfMinute,
    0,
    dcfDST,
    leapYear,
    dcfWeekDay,
    weekNumber
  );
  #ifdef DCF77_DO_WEATHER
    LedWeatherStatus( dcfWeatherBitNum, dcfWeatherDecodeStatus );
  #endif
}


void LedTest()
{
  // The displays are lit up sequentially because of the current draw.
  // When all is lit up at the same time, you would need a bigger power supply.

  // Outer LED ring
  for ( int i = 0; i < 60; i++ )  { // LED's ON
    setRingLed( LedRingOuter, i, true );
    sprite.pushSprite( 0, 0, TFT_BLACK );
  }
  for ( int i = 59; i >= 0; i-- ) { // LED's OFF
    setRingLed( LedRingOuter, i, false );
    sprite.pushSprite( 0, 0, TFT_BLACK );
  }
  // Inner LED ring
  for ( int i = 0; i < 60; i++ ) { // LED's ON
    setRingLed( LedRingInner, i, true );
    sprite.pushSprite( 0, 0, TFT_BLACK );
  }
  for ( int i = 59; i >= 0; i-- ) { // LED's OFF
    setRingLed( LedRingInner, i, false );
    sprite.pushSprite( 0, 0, TFT_BLACK );
  }
  for ( int i = 22; i <= 53; i++ ) { // LED's ON
    LedWeekStatus( i, HIGH );
    LedErrorStatus( i, HIGH );
    LedParityStatus( (i % 3) + 1, HIGH );
    sprite.pushSprite( 0, 0, TFT_BLACK );
  }
  // wait before turning the LED's off
  delay( LedTest_DELAY_DISPLAYS );
  for ( int i = 53; i >= 22; i-- ) { // LED's OFF
    LedWeekStatus( i, LOW );
    LedErrorStatus( i, LOW );
    LedParityStatus( (i % 3) + 1, LOW );
    sprite.pushSprite( 0, 0, TFT_BLACK );
  }
  LedWeekStatus( LED_WEEKNUMBER, -1 );
  drawWeekDays( -1 );
  sprite.pushSprite( 0, 0, TFT_BLACK );

  #ifdef DCF77_DO_WEATHER
    for( int e=-1; e<2; e++ ) {
      for( int i=1; i<4; i++ ) {
        LedWeatherStatus( i%3, e, false );
        sprite.pushSprite( 0, 0, TFT_BLACK );
        delay(10);
      }
      delay(20);
    }
    LedWeatherStatus( 1, 0, false );
    sprite.pushSprite( 0, 0, TFT_BLACK );
  #endif


}


void initialize(void)
{

  M5Begin();
  Serial.printf("Started serial at %d bauds\n", SERIAL_SPEED);

  #if defined tftBrightness
    tft.setBrightness(tftBrightness);
  #endif

  //M5.NVS.Dump();
  //M5.NVS.Erase();

  InitPins();
  InitUI();

  // Reset DCFbitBuffer array, positions 0-59 (=60 bits)
  for ( int i = 0; i < 60; i++ ) {
    DCFbitBuffer[i] = 0;
    DCFbitFinalBuffer[i] = 0;
  }

  initSpeaker();
  initRTC();
  if ( PERFORM_LED_TEST == 1 ) {
    LedTest();
  }
  // activate errorCounter display after LED test
  LedDisplay( DisplayBufferBitError, "R", 0 );

  // reset timers
  leadingEdge         = millis();
  trailingEdge        = millis();
  previousLeadingEdge = millis()-1000;
  bufferPosition      = second()+1; // attempt to recover position from RTC

  // spawn tasks
  initTasks();
}


#endif // _UI_H_
